c++/soap/demo/soap-server001/RECV.log

a
-
a
s
POST / HTTP/1.1
Host: 127.0.1.1:8081
User-Agent: gSOAP/2.7
Content-Type: text/xml; charset=utf-8
Content-Length: 446
Connection: keep-alive
SOAPAction: ""

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns="urn:calc"><SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><ns:add><a>1</a><b>2</b></ns:add></SOAP-ENV:Body></SOAP-ENV:Envelope>