MFC-2010/gSOAP/client-windows/calcSSLgSOAP/SENT.log

POST / HTTP/1.1
Host: 10.49.46.201:2012
User-Agent: gSOAP/2.8
Content-Type: text/xml; charset=utf-8
Content-Length: 448
Connection: close

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns="urn:calc"><SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><ns:add><a>2</a><b>3</b></ns:add></SOAP-ENV:Body></SOAP-ENV:Envelope>
POST / HTTP/1.1
Host: 10.49.46.201:2012
User-Agent: gSOAP/2.8
Content-Type: text/xml; charset=utf-8
Content-Length: 448
Connection: close

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns="urn:calc"><SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><ns:add><a>2</a><b>3</b></ns:add></SOAP-ENV:Body></SOAP-ENV:Envelope>
POST / HTTP/1.1
Host: 10.49.46.201:2012
User-Agent: gSOAP/2.8
Content-Type: text/xml; charset=utf-8
Content-Length: 448
Connection: close

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns="urn:calc"><SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><ns:add><a>2</a><b>3</b></ns:add></SOAP-ENV:Body></SOAP-ENV:Envelope>
POST / HTTP/1.1
Host: 10.49.46.201:2012
User-Agent: gSOAP/2.8
Content-Type: text/xml; charset=utf-8
Content-Length: 448
Connection: close

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns="urn:calc"><SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><ns:add><a>2</a><b>3</b></ns:add></SOAP-ENV:Body></SOAP-ENV:Envelope>
POST / HTTP/1.1
Host: 10.49.46.201:2012
User-Agent: gSOAP/2.8
Content-Type: text/xml; charset=utf-8
Content-Length: 448
Connection: close

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns="urn:calc"><SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><ns:add><a>2</a><b>3</b></ns:add></SOAP-ENV:Body></SOAP-ENV:Envelope>
POST / HTTP/1.1
Host: 10.49.46.201:2012
User-Agent: gSOAP/2.8
Content-Type: text/xml; charset=utf-8
Content-Length: 448
Connection: close

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns="urn:calc"><SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><ns:add><a>2</a><b>3</b></ns:add></SOAP-ENV:Body></SOAP-ENV:Envelope>
POST / HTTP/1.1
Host: 10.49.46.201:2012
User-Agent: gSOAP/2.8
Content-Type: text/xml; charset=utf-8
Content-Length: 448
Connection: close

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns="urn:calc"><SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><ns:add><a>2</a><b>3</b></ns:add></SOAP-ENV:Body></SOAP-ENV:Envelope>
POST / HTTP/1.1
Host: 10.49.46.201:2012
User-Agent: gSOAP/2.8
Content-Type: text/xml; charset=utf-8
Content-Length: 448
Connection: close

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns="urn:calc"><SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><ns:add><a>2</a><b>3</b></ns:add></SOAP-ENV:Body></SOAP-ENV:Envelope>
POST / HTTP/1.1
Host: 10.49.46.201:2012
User-Agent: gSOAP/2.8
Content-Type: text/xml; charset=utf-8
Content-Length: 448
Connection: close

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns="urn:calc"><SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><ns:add><a>2</a><b>3</b></ns:add></SOAP-ENV:Body></SOAP-ENV:Envelope>
POST / HTTP/1.1
Host: 10.49.46.201:2012
User-Agent: gSOAP/2.8
Content-Type: text/xml; charset=utf-8
Content-Length: 448
Connection: close

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns="urn:calc"><SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><ns:add><a>2</a><b>3</b></ns:add></SOAP-ENV:Body></SOAP-ENV:Envelope>
POST / HTTP/1.1
Host: 10.49.46.201:2012
User-Agent: gSOAP/2.8
Content-Type: text/xml; charset=utf-8
Content-Length: 448
Connection: close

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns="urn:calc"><SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><ns:add><a>2</a><b>3</b></ns:add></SOAP-ENV:Body></SOAP-ENV:Envelope>
POST / HTTP/1.1
Host: 10.49.46.201:2012
User-Agent: gSOAP/2.8
Content-Type: text/xml; charset=utf-8
Content-Length: 448
Connection: close

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns="urn:calc"><SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><ns:add><a>2</a><b>3</b></ns:add></SOAP-ENV:Body></SOAP-ENV:Envelope>
POST / HTTP/1.1
Host: 10.49.46.201:2012
User-Agent: gSOAP/2.8
Content-Type: text/xml; charset=utf-8
Content-Length: 448
Connection: close

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns="urn:calc"><SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><ns:add><a>2</a><b>3</b></ns:add></SOAP-ENV:Body></SOAP-ENV:Envelope>
POST / HTTP/1.1
Host: 10.49.46.201:2012
User-Agent: gSOAP/2.8
Content-Type: text/xml; charset=utf-8
Content-Length: 448
Connection: close

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns="urn:calc"><SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><ns:add><a>2</a><b>3</b></ns:add></SOAP-ENV:Body></SOAP-ENV:Envelope>
POST / HTTP/1.1
Host: 10.49.46.201:2012
User-Agent: gSOAP/2.8
Content-Type: text/xml; charset=utf-8
Content-Length: 448
Connection: close

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns="urn:calc"><SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><ns:add><a>7</a><b>3</b></ns:add></SOAP-ENV:Body></SOAP-ENV:Envelope>
POST / HTTP/1.1
Host: 10.49.46.201:2012
User-Agent: gSOAP/2.8
Content-Type: text/xml; charset=utf-8
Content-Length: 448
Connection: close

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns="urn:calc"><SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><ns:add><a>7</a><b>3</b></ns:add></SOAP-ENV:Body></SOAP-ENV:Envelope>
POST / HTTP/1.1
Host: 10.49.46.201:2012
User-Agent: gSOAP/2.8
Content-Type: text/xml; charset=utf-8
Content-Length: 448
Connection: close

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns="urn:calc"><SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><ns:add><a>7</a><b>3</b></ns:add></SOAP-ENV:Body></SOAP-ENV:Envelope>
